src/artillery/register-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10

scenarios:
  - flow:
      - post:
          url: "/register"
          json:
            firstName: "John"
            lastName: "Doe"
            age: 30
            email: "john.doe@example.com"
            password: "password123"
      - post:
          url: "/register"
          json:
            firstName: "Jane"
            lastName: "Smith"
            age: 25
            email: "jane.smith@example.com"
            password: "password456"
      - post:
          url: "/register"
          json:
            firstName: "Alice"
            lastName: "Johnson"
            age: 28
            email: "alice.johnson@example.com"
            password: "password789"
      - post:
          url: "/register"
          json:
            firstName: "Bob"
            lastName: "Brown"
            age: 35
            email: "bob.brown@example.com"
            password: "password101"